/* -------------------------------------------------------------------------- */
/* Enums */
/* -------------------------------------------------------------------------- */

/* TINTodoStatus */

"OLNMOe" = "状況"; /* Display Name */

"mQr54o" = "不明";   /* Value: unknown */
"8K78Gu" = "開いている";      /* Value: open */
"HSjTOt" = "完了済み"; /* Value: completed */
"1Ncljt" = "キャンセル済み";  /* Value: canceled */

/* -------------------------------------------------------------------------- */
/* Types */
/* -------------------------------------------------------------------------- */

/* TINTodo */

"OMXxQN" = "Things To-Do"; /* Display Name */

"q1gqw8" = "UUID";      /* Property: uuid */
"LiLlEf" = "タイトル";     /* Property: title */
"Kw5NWX" = "リスト";      /* Property: list */
"R3fuSz" = "いつ";      /* Property: when */
"8TjwzE" = "夜";   /* Property: evening */
"gRh7no" = "いいえ";        /* Property: evening (false value) */
"WHB5qC" = "はい";       /* Property: evening (true value) */
"bww4JS" = "リマインダー";  /* Property: reminder */
"19lPBk" = "期限";  /* Property: deadline */
"pp3qBd" = "メモ";     /* Property: notes */
"UDIc1x" = "チェックリスト"; /* Property: checklist */
"KQzIKq" = "タグ";      /* Property: tags */

/* TINList */

"x7Empa" = "Thingsリスト"; /* Display Name */

/* -------------------------------------------------------------------------- */
/* Intents */
/* -------------------------------------------------------------------------- */

/* TINAddTodo */

"jUtU4g" = "To-Doを追加"; /* Title */
"1Xn7Aa" = "Thingsに新規To-Doを追加します。"; /* Description */

"YmSQDf" = "To-Do"; /* Parameter: title */
"LHHz9E" = "タイトルは何ですか？"; /* Parameter: title, dialog (Primary) */

"ZlzpNK" = "リスト"; /* Parameter: list */
"X4r1DR" = "どのリストに追加したいですか？"; /* Parameter: list, dialog (DisambiguationSelection) */

"unnTAD" = "いつ"; /* Parameter: when */
"VkNe0C" = "始めますか？"; /* Parameter: when, dialog (Primary) */

"gaX3hF" = "夜"; /* Parameter: evening */
"b10WOZ" = "夜ですか？"; /* Parameter: evening, dialog (Primary) */
"0fPzah" = "いいえ"; /* Parameter: evening (false value) */
"KWUIrj" = "はい"; /* Parameter: evening (true value) */

"AeXgbS" = "リマインダーの時刻"; /* Parameter: reminderTime */
"3Nk1Yl" = "何時に通知しますか？"; /* Intent TINAddTodo -> Parameter: reminderTime, dialog (Primary) */

"BzuFhi" = "期限"; /* Parameter: deadline */
"xi8sPe" = "期限はいつですか？"; /* Parameter: deadline, dialog (Primary) */

"NYFM84" = "タグ"; /* Parameter: tags */
"l0xizU" = "どのタグを追加しますか？"; /* Parameter: tags, dialog (Primary) */

"tfx4bF" = "状況"; /* Parameter: status */
"sS5Ms4" = "どんな状況ですか？"; /* Parameter: status, dialog (DisambiguationSelection) */

"DZdOjf" = "Thingsで編集"; /* Parameter: editInThings */
"W5N6Yo" = "Thingsを開いてこのTo-Doを編集しますか？"; /* Parameter: editInThings, dialog (Primary) */
"bRVelp" = "いいえ"; /* Parameter: editInThings (false value) */
"ZSGv41" = "はい"; /* Parameter: editInThings (true value) */

"o8AABR" = "メモ"; /* Parameter: notes */
"pjyLst" = "どのメモを追加したいですか？"; /* Parameter: notes, dialog (Primary) */

"uHRvWn" = "チェックリスト"; /* Parameter: checklist */
"VIitBC" = "どのチェックリストの項目を追加したいですか？"; /* Parameter: checklist, dialog (Primary) */

"6nhwMl" = "${todoTitle}はすでに追加されています。"; /* Response Code: success (voice-only dialog) */
"NKVz1k" = "${todoTitle}はすでに追加されています。"; /* Response Code: success (printed dialog) */
"sr1IRz" = "To-Doを追加する際にエラーが起きました。"; /* Response Code: failure (voice-only dialog) */
"LyHwKB" = "To-Doを追加する際にエラーが起きました。"; /* Response Code: failure (printed dialog) */
"j6LE7B" = "そのTo-Doは追加されています。"; /* Response Code: successEmptyTitle (voice-only dialog) */
"rNH42i" = "そのTo-Doは追加されています。"; /* Response Code: successEmptyTitle (printed dialog) */

"Lj80pA" = "To-Doのタイトル"; /* Response Parameter: todoTitle */
"Br1Zm3" = "To-Do"; /* Response Parameter: todo */

"9LylOv" = "${title}を追加"; /* Shortcuts App: title,list,status,when,deadline,notes,checklist,tags,editInThings (title) */
"wBHz6x" = "${title}を追加"; /* Shortcuts App: title,notes,checklist,when,deadline,tags,list,status,editInThings,reminderTime,evening (title) */

/* TINShowTodo */

"jANQXX" = "To-Doを表示"; /* Title */
"JdIZ8x" = "指定されたTo-DoをThingsに表示します。"; /* Description */

"WAIq5F" = "To-Do"; /* Parameter: todo */

"YIbDyi" = "${todo}を表示"; /* Shortcuts App: todo (title) */

/* TINShowList */

"ptz6wF" = "リストを表示"; /* Title */
"xo5PDm" = "Thingsに指定したリストを表示します。"; /* Description */

"RW2Nyz" = "リスト"; /* Parameter: list */
"V1nlDA" = "どのリストですか？"; /* Parameter: list, dialog (DisambiguationSelection) */

"3hu2WN" = "タグで絞り込み"; /* Parameter: filterByTags */
"HQ0TAS" = "どのタグですか？"; /* Parameter: filterByTags, dialog (DisambiguationSelection) */

"vKhBKF" = "${list}を表示"; /* Shortcuts App: list,filterByTags (title) */
"poYHAf" = "${list}を表示"; /* Shortcuts App: list (title) */

"mlANgr" = "${list}を表示"; /* Suggestions: list (title) */

/* TINRunThingsURL */

"lW66Em" = "Things URLを実行"; /*  Title */
"keYeZ9" = "バックグラウンドでThings URLを実行します。"; /*  Description */

"uPeA3l" = "Things URL"; /*  Parameter: url */
"oTrE0f" = "どのURLですか？"; /* Intent TINRunThingsURL -> Parameter: url, dialog (Primary) */

"Xq4kUL" = "URLの実行を完了しました。"; /*  Response Code: success (voice-only dialog) */
"DDKH5R" = "URLの実行を完了しました。"; /*  Response Code: success (printed dialog) */
"a4aEdR" = "URLを実行中にエラーが起きました。"; /*  Response Code: failure (voice-only dialog) */
"LNTEqX" = "URLを実行中にエラーが起きました。"; /*  Response Code: failure (printed dialog) */

"uth0Px" = "Things URLを実行 ${url}"; /*  Shortcuts App: url (title) */

/* INAddTasks (customized system intent) */

"3s4Pq7" = "タスクを追加"; /* Title */
"J4CdGj" = "内蔵機能を使用してThingsにTo-Doを追加します。限られたパラメーターのみをサポートします。"; /* Intent AddTasks -> Description */

"IF3OZi" = "タスクリスト"; /* Parameter: targetTaskList */
"uNB8yE" = "タイトル"; /* Parameter: taskTitles */
"2x4fQs" = "Spatial Event Trigger"; /* Parameter: spatialEventTrigger */
"itSKVK" = "Temporal Event Trigger"; /* Parameter: temporalEventTrigger */

"sLae48" = "Thingsを開く"; /* Suggestions:  (title) */
